cat/app/controllers/cats_controller.rb

    def update
        cat = Cat.find_by(id: params[:id])
        if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = ?, "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["color", "White"], ["description", "Loves to eat Alot"], ["updated_at", "2020-12-04 22:08:19.005937"], ["id", 7]]

    def create
        cat = Cat.new(cat_params)
        if cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)